######################################################################
# Essentials                                                         #
######################################################################
brew "git"
brew "tmux"

######################################################################
# Basics                                                             #
######################################################################
brew "bat"
brew "exa"
brew "fzf" # For fuzzy search within zoxide
brew "micro"
brew "zoxide"

######################################################################
# Reference                                                          #
######################################################################
brew "tldr"

######################################################################
# Monitoring and Performance                                         #
######################################################################
brew "speedtest-cli"

######################################################################
# CLI External Services                                              #
######################################################################
brew "asciinema"

######################################################################
# CLI Fun                                                            #
######################################################################
brew "cmatrix"
brew "cointop"
brew "figlet"
brew "lolcat"
brew "neofetch"
brew "newsboat"

######################################################################
# macOS                                                              #
######################################################################

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-meslo-lg-nerd-font'