######################################################################
# Essentials                                                         #
######################################################################
brew "git"
brew "tmux"

######################################################################
# Basics                                                             #
######################################################################
brew "bat"
brew "eza"
brew "fzf" # For fuzzy search within zoxide
brew "micro"
brew "zoxide"

######################################################################
# Reference                                                          #
######################################################################
brew "tlrc"

######################################################################
# Monitoring and Performance                                         #
######################################################################
brew "speedtest"

######################################################################
# CLI External Services                                              #
######################################################################
brew "asciinema"

######################################################################
# CLI Fun                                                            #
######################################################################
brew "cmatrix"
brew "figlet"
brew "fastfetch"
brew "newsboat"

######################################################################
# macOS                                                              #
######################################################################

# Fonts
cask 'font-meslo-lg-nerd-font'